# Lab | Data Cleaning and Formatting

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

In [1]:
import pandas as pd

data = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv'

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

*Hint*:
- *Column names should be in lower case*
- *White spaces in column names should be replaced by `_`*
- *`st` could be replaced for `state`*

In [2]:
insurance_df = pd.read_csv(data)
insurance_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4008 entries, 0 to 4007
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Customer                   1071 non-null   object
 1   ST                         1071 non-null   object
 2   GENDER                     954 non-null    object
 3   Education                  1071 non-null   object
 4   Customer Lifetime Value    1068 non-null   object
 5   Income                     1071 non-null   float64
 6   Monthly Premium Auto       1071 non-null   float64
 7   Number of Open Complaints  1071 non-null   object
 8   Policy Type                1071 non-null   object
 9   Vehicle Class              1071 non-null   object
 10  Total Claim Amount         1071 non-null   float64
dtypes: float64(3), object(8)
memory usage: 344.6+ KB

In [3]:
# Changing column names
insurance_df.columns = insurance_df.columns.str.lower()
insurance_df.columns = insurance_df.columns.str.replace(' ', '_')
insurance_df.rename(columns={'st': 'state'}, inplace=True)
insurance_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4008 entries, 0 to 4007
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   1071 non-null   object
 1   state                      1071 non-null   object
 2   gender                     954 non-null    object
 3   education                  1071 non-null   object
 4   customer_lifetime_value    1068 non-null   object
 5   income                     1071 non-null   float64
 6   monthly_premium_auto       1071 non-null   float64
 7   number_of_open_complaints  1071 non-null   object
 8   policy_type                1071 non-null   object
 9   vehicle_class              1071 non-null   object
 10  total_claim_amount         1071 non-null   float64
dtypes: float64(3), object(8)
memory usage: 344.6+ KB

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they contain only valid data. 

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

*Hint*:
- *Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized, for example, to "M" and "F".*
- *State abbreviations can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"*
- *In education, "Bachelors" could be replaced by "Bachelor"*
- *In Customer Lifetime Value, delete the `%` character*
- *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*

In [4]:
print(insurance_df.gender.unique())
print(insurance_df.state.unique())
print(insurance_df.education.unique())
print(insurance_df.customer_lifetime_value.unique())
print(insurance_df.vehicle_class.unique())

[nan 'F' 'M' 'Femal' 'Male' 'female']
['Washington' 'Arizona' 'Nevada' 'California' 'Oregon' 'Cali' 'AZ' 'WA'
 nan]
['Master' 'Bachelor' 'High School or Below' 'College' 'Bachelors' 'Doctor'
 nan]
[nan '697953.59%' '1288743.17%' ... '2031499.76%' '323912.47%'
 '899704.02%']
['Four-Door Car' 'Two-Door Car' 'SUV' 'Luxury SUV' 'Sports Car'
 'Luxury Car' nan]

In [5]:
insurance_df['gender'] = insurance_df['gender'].replace(['Femal', 'female'], 'F')
insurance_df['gender'] = insurance_df['gender'].replace('Male', 'F')

insurance_df['state'] = insurance_df['state'].replace('AZ', 'Arizona')
insurance_df['state'] = insurance_df['state'].replace('WA', 'Washington')
insurance_df['state'] = insurance_df['state'].replace('Cali', 'California')

insurance_df['education'] = insurance_df['education'].replace('Bachelors', 'Bachelor')

insurance_df['customer_lifetime_value'] = insurance_df['customer_lifetime_value'].replace('%', '')

insurance_df['vehicle_class'] = insurance_df['vehicle_class'].replace(['Sports Car', 'Luxury SUV', 'Luxury Car'], 'Luxury')

In [6]:
print(insurance_df.gender.unique())
print(insurance_df.state.unique())
print(insurance_df.education.unique())
print(insurance_df.customer_lifetime_value.unique())
print(insurance_df.vehicle_class.unique())

[nan 'F' 'M']
['Washington' 'Arizona' 'Nevada' 'California' 'Oregon' nan]
['Master' 'Bachelor' 'High School or Below' 'College' 'Doctor' nan]
[nan '697953.59%' '1288743.17%' ... '2031499.76%' '323912.47%'
 '899704.02%']
['Four-Door Car' 'Two-Door Car' 'SUV' 'Luxury' nan]

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

*Hint*:
- *Customer lifetime value should be numeric*
- *Number of open complaints has a wrong format, look at the diffrent values it takes with unique() and take the middle value, for example 1/5/00 should be 5. Number of open complaints is a string, remember you can use split() to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.*

In [7]:
insurance_df['customer_lifetime_value'] = insurance_df['customer_lifetime_value'].str.strip('%').apply(float)

In [8]:
insurance_df.number_of_open_complaints.unique()

array(['1/0/00', '1/2/00', '1/1/00', '1/3/00', '1/5/00', '1/4/00', nan],
      dtype=object)

In [9]:
complaints = list(insurance_df['number_of_open_complaints'])
complaints_cleaned = []
for complaint in complaints:
    complaint = str(complaint) # we need to convert each item to a string to apply the split method
    if complaint != 'nan':
        complaint = complaint.split('/')
        complaints_cleaned.append(int(complaint[1]))
    else:
        complaints_cleaned.append(complaint)

In [10]:
len(complaints_cleaned)

4008

In [11]:
insurance_df['number_of_open_complaints'] = complaints_cleaned
insurance_df['number_of_open_complaints'].apply(float)

0       0.0
1       0.0
2       0.0
3       0.0
4       0.0
       ...
4003    NaN
4004    NaN
4005    NaN
4006    NaN
4007    NaN
Name: number_of_open_complaints, Length: 4008, dtype: float64

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the isnull() function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (we haven't studied this yet)

Implement your chosen strategy to handle the null values. You can use the fillna() function in pandas to fill null values or dropna() function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the isnull() function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values. 

After formatting data types, as a last step, convert all the numeric variables to integers using applymap.

In [12]:
insurance_df.shape

(4008, 11)

In [13]:
round(insurance_df.isnull().sum() * 100 / insurance_df.shape[0], 2)

customer                     73.28
state                        73.28
gender                       76.20
education                    73.28
customer_lifetime_value      73.35
income                       73.28
monthly_premium_auto         73.28
number_of_open_complaints     0.00
policy_type                  73.28
vehicle_class                73.28
total_claim_amount           73.28
dtype: float64

In [ ]:
# We can see that from the 4008 rows we have in the dataset, almost 3/4 of them don't have any data (NULL).
# Before filling the null values, we should remove the rows that don't contain any data.
# A big part of the dataset is not useful to perform any analysis.

In [14]:
df_copy = insurance_df.copy()
print(df_copy.shape)

(4008, 11)

In [15]:
# We eliminate the rows that have all of the columns NULL
df_copy.dropna(how='all', inplace=True)

In [16]:
df_copy.info()
# Now we can see that all of our columns have non-null data except for gender and customer_lifetime_value

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4008 entries, 0 to 4007
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   1071 non-null   object
 1   state                      1071 non-null   object
 2   gender                     954 non-null    object
 3   education                  1071 non-null   object
 4   customer_lifetime_value    1068 non-null   float64
 5   income                     1071 non-null   float64
 6   monthly_premium_auto       1071 non-null   float64
 7   number_of_open_complaints  4008 non-null   object
 8   policy_type                1071 non-null   object
 9   vehicle_class              1071 non-null   object
 10  total_claim_amount         1071 non-null   float64
dtypes: float64(4), object(7)
memory usage: 344.6+ KB

In [17]:
df_copy_gender = df_copy.groupby(['gender'])['gender'].count()
df_copy_gender

gender
F    541
M    413
Name: gender, dtype: int64

In [ ]:
# We can see that there are 541 Females and 413 Males in our dataset. It seems that replacing the null values for
# the mode is not a good idea, so I will fill the null values with the previous one.
# For the CLV there are only 3 values missing, so I will use the median to replace the nulls.

In [18]:
df_copy['gender'].fillna(method='bfill', inplace=True)
df_copy['customer_lifetime_value'].fillna(df_copy['customer_lifetime_value'].median(), inplace=True)

In [19]:
df_copy.tail()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
4003,NaN,NaN,NaN,NaN,588174.235,NaN,NaN,nan,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN,588174.235,NaN,NaN,nan,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN,588174.235,NaN,NaN,nan,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN,588174.235,NaN,NaN,nan,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN,588174.235,NaN,NaN,nan,NaN,NaN,NaN

## Exercise 5: Dealing with duplicates

Use the .duplicated() method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the drop_duplicates() function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using .duplicated().

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

*Hint*: *after dropping duplicates, reset the index to ensure consistency*.

In [20]:
df_copy.duplicated().sum()

2936

In [21]:
df_copy.shape

(4008, 11)

In [22]:
df_copy.drop_duplicates(inplace=True)

In [23]:
df_copy.duplicated().sum()

0

In [24]:
df_copy.reset_index(drop=True)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,F,Master,588174.235,0.0,1000.0,0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.590,0.0,94.0,0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.170,48767.0,108.0,0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.180,0.0,106.0,0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.650,36357.0,68.0,0,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
1067,VJ51327,California,F,High School or Below,2031499.760,63209.0,102.0,2,Personal Auto,SUV,207.320041
1068,GS98873,Arizona,F,Bachelor,323912.470,16061.0,88.0,0,Personal Auto,Four-Door Car,633.600000
1069,CW49887,California,F,Master,462680.110,79487.0,114.0,0,Special Auto,SUV,547.200000
1070,MY31220,California,F,College,899704.020,54230.0,112.0,0,Personal Auto,Two-Door Car,537.600000
1071,NaN,NaN,NaN,NaN,588174.235,NaN,NaN,nan,NaN,NaN,NaN

In [ ]:
df_copy.to_csv('insurance_clean.csv')

# Bonus: Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting. 

Write these functions in a separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [ ]:
# Your code here

# Bonus: Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we tried to do work with that column, we wouldn't have been able to do it because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, lets get some more interesting insights!

Instructions:

- Review again the statistics for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the .describe() method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [ ]:
# Your code here